SoCXin/MM32L062/project/Device/MM32L06xx_s/Include/reg_gpio.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_gpio.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_GPIO_H
#define __REG_GPIO_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"




#if defined ( __CC_ARM )
#pragma anon_unions
#endif








////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO Base Address Definition
////////////////////////////////////////////////////////////////////////////////

#define GPIOA_BASE                  (AHB2PERIPH_BASE + 0x0000)                  ///< Base Address: 0x48000000
#define GPIOB_BASE                  (AHB2PERIPH_BASE + 0x0400)                  ///< Base Address: 0x48000400

#define GPIOC_BASE                  (AHB2PERIPH_BASE + 0x0800)                  ///< Base Address: 0x48000800
#define GPIOD_BASE                  (AHB2PERIPH_BASE + 0x0C00)                  ///< Base Address: 0x48000C00



////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO Registers Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 CRL;                                                               ///< Control Register Low,                          offset: 0x00
    __IO u32 CRH;                                                               ///< Control Register High,                         offset: 0x04
    __IO u32 IDR;                                                               ///< Input Data Register,                           offset: 0x08
    __IO u32 ODR;                                                               ///< Output Data Register,                          offset: 0x0C
    __IO u32 BSRR;                                                              ///< Bit Set or Reset Register,                     offset: 0x10
    __IO u32 BRR;                                                               ///< Bit Reset Register,                            offset: 0x14
    __IO u32 LCKR;                                                              ///< Lock Register,                                 offset: 0x18
    __IO u32 DCR;                                                               ///< Pin Output Open Drain Config Register,         offset: 0x1C
    __IO u32 AFRL;                                                              ///< Port Multiplexing Function Low Register,       offset: 0x20
    __IO u32 AFRH;                                                              ///< Port Multiplexing Function High Register,      offset: 0x24
} GPIO_TypeDef;



////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define GPIOA                           ((GPIO_TypeDef*) GPIOA_BASE)
#define GPIOB                           ((GPIO_TypeDef*) GPIOB_BASE)
#define GPIOC                           ((GPIO_TypeDef*) GPIOC_BASE)
#define GPIOD                           ((GPIO_TypeDef*) GPIOD_BASE)




////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO Common Register Bit Definition
////////////////////////////////////////////////////////////////////////////////

#define GPIO_CRL_MODE_MASK              (0x03U)                                 ///< Mode Mask
#define GPIO_CRL_MODE_0                 ((u32)0x00000001)                  ///< Bit 0
#define GPIO_CRL_MODE_1                 ((u32)0x00000002)                  ///< Bit 1
#define GPIO_CRL_MODE_IOMODE0           (0x00U)                                 ///< Mode = 0
#define GPIO_CRL_MODE_IOMODE1           (0x01U)                                 ///< Mode = 1
#define GPIO_CRL_MODE_IOMODE2           (0x02U)                                 ///< Mode = 2
#define GPIO_CRL_MODE_IOMODE3           (0x03U)                                 ///< Mode = 3
#define GPIO_CRL_CNF_MASK               (0x03U)                                 ///< CNF Mask
#define GPIO_CRL_CNF_0                  ((u32)0x00000001)                  ///< Bit 0
#define GPIO_CRL_CNF_1                  ((u32)0x00000002)                  ///< Bit 1
#define GPIO_CRL_CNF_MODE0              (0x00U)                                 ///< Mode = 0
#define GPIO_CRL_CNF_MODE1              (0x01U)                                 ///< Mode = 1
#define GPIO_CRL_CNF_MODE2              (0x02U)                                 ///< Mode = 2
#define GPIO_CRL_CNF_MODE3              (0x03U)                                 ///< Mode = 3


#define GPIO_CRH_MODE_MASK              (0x03U)                                 ///< Mode Mask
#define GPIO_CRH_MODE_0                 ((u32)0x00000001)                  ///< Bit 0
#define GPIO_CRH_MODE_1                 ((u32)0x00000002)                  ///< Bit 1
#define GPIO_CRH_MODE_IOMODE0           (0x00U)                                 ///< Mode = 0
#define GPIO_CRH_MODE_IOMODE1           (0x01U)                                 ///< Mode = 1
#define GPIO_CRH_MODE_IOMODE2           (0x02U)                                 ///< Mode = 2
#define GPIO_CRH_MODE_IOMODE3           (0x03U)                                 ///< Mode = 3
#define GPIO_CRH_CNF_MASK               (0x03U)                                 ///< CNF Mask
#define GPIO_CRH_CNF_0                  ((u32)0x00000001)                  ///< Bit 0
#define GPIO_CRH_CNF_1                  ((u32)0x00000002)                  ///< Bit 1
#define GPIO_CRH_CNF_MODE0              (0x00U)                                 ///< Mode = 0
#define GPIO_CRH_CNF_MODE1              (0x01U)                                 ///< Mode = 1
#define GPIO_CRH_CNF_MODE2              (0x02U)                                 ///< Mode = 2
#define GPIO_CRH_CNF_MODE3              (0x03U)                                 ///< Mode = 3

////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO_CRL Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define GPIO_CRL_MODE                   ((u32)0x33333333)                  ///< Port x mode bits

#define GPIO_CRL_MODE0_Pos              (0)
#define GPIO_CRL_MODE0                  (0x03U << GPIO_CRL_MODE0_Pos)           ///< MODE0[1:0] bits (portx mode bits, pin 0)
#define GPIO_CRL_MODE0_0                (0x01U << GPIO_CRL_MODE0_Pos)           ///< Bit 0
#define GPIO_CRL_MODE0_1                (0x02U << GPIO_CRL_MODE0_Pos)           ///< Bit 1

